In [2]:
import numpy as np
import scipy as sp
import pandas as pd 
import matplotlib.pyplot as plt

In [14]:
# df = pd.read_csv("../../Downloads/Salaries.csv")
df = pd.read_csv("https://rcs.bu.edu/examples/python/DataAnalysis/Salaries.csv")
df.head(10)
# df.head(20)
# df.head(50)
# df.dtypes
# df.axes
# df.size
# df.describe()
# df.columns

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [12]:
df['salary'].dtype

dtype('int64')

In [13]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [15]:
print(len(df))

78

In [16]:
print(df.size)

468

In [20]:
print(df.columns.tolist())

['rank', 'discipline', 'phd', 'service', 'sex', 'salary']

In [21]:
print(df.dtypes)

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object